[
  {
    "Name": "Buck_Intro",
    "SpeakerId": "Buck",
    "Text": "Well, butter my biscuit! Ain't you a sight for these tired old eyes, stranger! Name's Buck Johnson, but 'round here everybody just calls me Buck. Welcome to my garage,[br]where the coffee's strong and the stories last longer than a Texas summer day.[br]I been fixin' cars since I was knee-high to a grasshopper, and I've seen it all.[br]I watched your jalopy limpin' in like a three-legged coyote. Bless your heart![br]That ol' bucket looks like it's been rode hard and put away wet, if you don't mind me sayin'.",
    "ResponseText": "",
    "Branches": "Player_AskFix;Player_AskRace;Player_AskWork",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskFix",
    "SpeakerId": "Player",
    "Text": "Honestly, I was hoping you could fix my car, Buck.",
    "ResponseText": "",
    "Branches": "Buck_FixReply",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskRace",
    "SpeakerId": "Player",
    "Text": "That poster got me wondering about the race.",
    "ResponseText": "",
    "Branches": "Buck_ExplainRace",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskWork",
    "SpeakerId": "Player",
    "Text": "I need money to fix my car. Any work around here?",
    "ResponseText": "",
    "Branches": "Buck_OfferWork",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_FixReply",
    "SpeakerId": "Buck",
    "Text": "Lord have mercy, I wish I had better news for ya, partner. That ol' ride of yours is[br]stubborner than a mule in molasses, and parts for her are rarer than rain in July.[br]Most folks 'round here would send her straight to the scrapyard faster than greased[br]lightnin'. But I see potential, yes sir. Here's the deal, sweet pea - I could take that[br]rustbucket off your hands and set you up with somethin' that'll actually git you places.[br][color=0,0,0]All I ask is you do some racin' for me in the Maze. What d'you say to that?[/color]",
    "ResponseText": "",
    "Branches": "Player_RaceDeal;Player_DeclineLoop;Player_AskMazeRace",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_RaceDeal",
    "SpeakerId": "Player",
    "Text": "Alright, I'll race for you.",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_DeclineLoop",
    "SpeakerId": "Player",
    "Text": "Is there really no other way, Buck?",
    "ResponseText": "",
    "Branches": "Buck_DeclineLoop",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskMazeRace",
    "SpeakerId": "Player",
    "Text": "What's the Maze Race, Buck?",
    "ResponseText": "",
    "Branches": "Buck_ExplainRace",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_DeclineLoop",
    "SpeakerId": "Buck",
    "Text": "Well now, if there was another way, I'd tell you faster than a hiccup, honest as the day[br]is long. But this here's your one good shot, sugar. No other shop in town would touch[br]a car like that with a ten-foot pole. The Maze is tougher than a two-dollar steak, but[br]fair as a Sunday sermon, and it's your best chance to trade up from that rollin' wreck.[br]I ain't one to push, but opportunity's knockin' louder than my ex-wife after a spat.[br][color=0,0,0]So whatcha say - ready to give them wheels a spin in the Maze?[/color]",
    "ResponseText": "",
    "Branches": "Player_AcceptRace;Player_NeedMoney",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AcceptRace",
    "SpeakerId": "Player",
    "Text": "Alright, you've convinced me. Let's do this.",
    "ResponseText": "",
    "Branches": "Buck_AcceptResponse",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_NeedMoney",
    "SpeakerId": "Player",
    "Text": "I really just need money to repair my car, Buck.",
    "ResponseText": "",
    "Branches": "Buck_MoneyResponse",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
{
  "Name": "Buck_AcceptResponse",
  "SpeakerId": "Buck",
  "Text": "That's the spirit! You got more gumption than a jackrabbit with a firecracker under its tail![br]I knew you had the racer's spark in your eyes the moment you walked through my door.[br]Trust ol' Buck - this is gonna be the best decision you made since puttin' on pants this mornin'. The Maze might be wild, but the rewards are sweeter than my mama's peach cobbler. Been racin' these streets since before they started movin', and I know talent when I see it. And hey, between you and me? You got what it takes to be one of the greats round here.",
  "ResponseText": "",
  "Branches": "Player_ReadyForTest;Player_AskMoreDetails",
  "Traits": "Hub",
  "Conditions": "",
  "PreAction": "",
  "PostAction": "",
  "AudioClip": ""
},
  {
    "Name": "Buck_MoneyResponse",
    "SpeakerId": "Buck",
    "Text": "Money's what makes the world go 'round, ain't it? Well listen here, sugar - the Maze Race pays better than robbin' a bank, and it's legal to boot! First place can net you enough to fix twenty jalopies like yours. Even the slower drivers make decent coin just for showin' up and deliverin' packages through the shiftin' streets. This town rewards folks who can navigate the chaos. Play your cards right, and you'll be swimmin' in cash faster than a catfish in a rainstorm.",
    "ResponseText": "",
    "Branches": "Player_SoundsPerfect;Player_WhyNotEveryone",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_SoundsPerfect",
    "SpeakerId": "Player",
    "Text": "That sounds perfect. Let's get started.",
    "ResponseText": "",
    "Branches": "Buck_EnthuseResponse",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_WhyNotEveryone",
    "SpeakerId": "Player",
    "Text": "If it pays that well, why isn't everyone doing it?",
    "ResponseText": "",
    "Branches": "Buck_ExplainDanger",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_EnthuseResponse",
    "SpeakerId": "Buck",
    "Text": "Now that's what I call the right attitude! Most folks hear about the Maze and start[br]shakin' in their boots like a chihuahua in a snowstorm. But you? You got sand, partner![br]I knew from the minute you dragged that sorry excuse for a vehicle in here that you were[br]different. Reminds me of my younger self - ready to take on the world with nothin' but[br]determination and a socket wrench. Let's get you set up with some proper wheels!",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_ExplainDanger",
    "SpeakerId": "Buck",
    "Text": "Ha! Smart question there, slick! The Maze ain't exactly a Sunday drive in the park.[br]This town... it ain't natural. Streets change, buildings move, sometimes right while[br]you're drivin' past 'em! Plenty of racers come here thinkin' they'll make a quick buck,[br]but end up runnin' home with their tail between their legs. Some don't make it out at all.[br]The ones who can handle it? They get rewarded handsomely. And I got a feelin' you might[br]just have what it takes to be one of the special ones.",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_ExplainRace",
    "SpeakerId": "Buck",
    "Text": "The Maze Race? Well slap my knee and call me excited - that's somethin' special![br]Folks from all over show up hopin' for glory and cold hard cash. The Maze ain't just[br]a bunch of dirt and turns - it's got more twists than a rattlesnake in a rollin' hoop![br]This whole town, it changes layout quicker than a chameleon changes colors. Streets shift,[br]buildings move - gives me the vapors just thinkin' about it! That's why we need drivers.[br][color=0,0,0]You look like you got the gumption for it - ready to get behind a wheel?[/color]",
    "ResponseText": "",
    "Branches": "Player_ReadyToRace;Player_AskEarnings",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_ReadyToRace",
    "SpeakerId": "Player",
    "Text": "Yes, I'm ready to race.",
    "ResponseText": "",
    "Branches": "Buck_EnthusiasticResponse",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskEarnings",
    "SpeakerId": "Player",
    "Text": "Will this really help me earn enough to fix my car?",
    "ResponseText": "",
    "Branches": "Buck_ReassuranceResponse",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
{
  "Name": "Buck_EnthusiasticResponse",
  "SpeakerId": "Buck",
  "Text": "Hot diggity dog! That's what I like to hear - a go-getter with fire in their belly![br]You remind me of myself back when my mustache was still more pepper than salt.[br]The Maze is gonna love you - new blood always makes for an excitin' race day.[br]And between you and me? I might have a special wager or two lined up on your performance when you hit the track against the other rookies this season.[br]Not that I'm puttin' pressure on ya, but ol' Buck's got a good feelin' about your chances.",
  "ResponseText": "",
  "Branches": "Player_ReadyForTest;Player_AskMoreDetails",
  "Traits": "Hub",
  "Conditions": "",
  "PreAction": "",
  "PostAction": "",
  "AudioClip": ""
},
  {
    "Name": "Player_ReadyForTest",
    "SpeakerId": "Player",
    "Text": "Let me try these cars you mentioned.",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskMoreDetails",
    "SpeakerId": "Player",
    "Text": "Tell me more about these cars first.",
    "ResponseText": "",
    "Branches": "Buck_ExplainCars",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_ExplainCars",
    "SpeakerId": "Buck",
    "Text": "Oh, these ain't just any cars, partner! Each one's got its own personality, like kids[br]in a family. The red one - that's 'Thunderbolt' - zero to sixty faster than you can say[br]jackrabbit. Great for quick getaways and catchin' up, but twitchy as a cat in a room full[br]of rockin' chairs. The blue one's 'Marathon' - slower off the line, but once she hits her[br]stride, ain't nothin' gonna catch her on a straightaway. Then there's the green 'Sidewinder'[br]- sticks to corners like my aunt's pecan pie sticks to your ribs. Your choice matters!",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_ReassuranceResponse",
    "SpeakerId": "Buck",
    "Text": "Fix your car? Honey, if you can handle yourself in the Maze, you'll earn enough to buy a whole fleet of cars! The prize money would make your eyes pop out like a cartoon character. This ain't just some podunk derby - we got sponsors bigger than Texas pourin' money in. Plus, daily deliveries through the Maze pay handsomely too. Dangerous work means good pay. Why, last season's rookie champion started just like you - broke as a churchmouse with a busted radiator. Now they're drivin' a custom job that'd make the devil himself turn green with envy.",
    "ResponseText": "",
    "Branches": "Player_SoundsPerfect;Player_WhyNotEveryone",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_OfferWork",
    "SpeakerId": "Buck",
    "Text": "Work, you say? Well butter my butt and call me a biscuit! I always need a hand 'round here,[br]specially someone with a little fire left in their furnace. How about you help me by racin'[br]in the Maze? Winner gets a stack of cash taller than a Texas pine, and you'll earn your[br]keep while you're at it. I got more delivery jobs than a one-legged man has shoes, and[br]customers waitin' longer than Christmas mornin'. That jalopy won't cut it, but I got wheels[br][color=0,0,0]you can borrow. Whatcha say - ready to earn your spurs as a Maze Runner?[/color]",
    "ResponseText": "",
    "Branches": "Player_AcceptWork;Player_AskPay",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AcceptWork",
    "SpeakerId": "Player",
    "Text": "Sounds like good work. I'll take it.",
    "ResponseText": "",
    "Branches": "Buck_WorkAcceptResponse",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskPay",
    "SpeakerId": "Player",
    "Text": "How much does this job pay exactly?",
    "ResponseText": "",
    "Branches": "Buck_PayExplanation",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
{
  "Name": "Buck_WorkAcceptResponse",
  "SpeakerId": "Buck",
  "Text": "Well now, you just made my day brighter than a new penny! Got myself a driver with some[br]backbone - that's rarer than hen's teeth 'round here lately. Most folks hear about the Maze[br]and run faster than a scalded dog. But not you! I can already tell we're gonna get along[br]like peas and carrots. You got that look in your eye - same one my champion drivers all had when they first walked through my door. Determination thicker than Texas toast! Let me tell you, partner, this could be the start of somethin' real special.",
  "ResponseText": "",
  "Branches": "Player_ReadyForTest;Player_AskMoreDetails",
  "Traits": "Hub",
  "Conditions": "",
  "PreAction": "",
  "PostAction": "",
  "AudioClip": ""
},
  {
    "Name": "Buck_PayExplanation",
    "SpeakerId": "Buck",
    "Text": "How much? Well, let me put it this way - my drivers don't worry about payin' rent, that's for darn sure! Base pay starts at twice what you'd make flippin' burgers, plus bonuses for speed and special deliveries. Complete the weekly championship circuit? That's where the real money flows like honey. Last season's winner took home enough to buy a lakehouse, cash on the barrelhead! And that don't even count the side bets and sponsorship deals once you make a name. This town rewards those brave enough to face the Maze, friend. It'll make your wallet fat.",
    "ResponseText": "",
    "Branches": "Player_SoundsPerfect;Player_WhyNotEveryone",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_GoToTestArea",
    "SpeakerId": "Buck",
    "Text": "Alright now, you're cookin' with gas! Let's get you movin' faster than a jackrabbit. Out behind this garage, I've got a little test area - nothin' fancy, but good enough to stretch your legs and get the feel of things. There's three cars out there waitin' on you: One's built for acceleration quicker than a hiccup, another's got top speed that'll make your eyes water, and the third handles corners tighter than my Aunt Mabel's corset. Go on and take 'em for a spin - find your perfect dance partner for the big Maze! When you've picked your winner, drive that beauty right back into the garage bay and I'll be waitin' there to get you all squared away for your first real race.",
    "ResponseText": "",
    "Branches": "",
    "Traits": "End",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  }
]