[
  {
    "Name": "Buck_Intro",
    "SpeakerId": "Buck",
    "Text": "Well, howdy there, friend! Name's Buck Johnson, but everybody just calls me Buck. Welcome to my garage, where the coffee's strong and the stories last longer than a summer day. I saw your old car limpin' in. She's got a lot of miles and a whole lot of grit. You were eyeballin' that old poster by the door—so tell me, you lookin' for repairs, or are you curious about a little adventure?",
    "ResponseText": "",
    "Branches": "Player_AskFix;Player_AskRace;Player_AskWork",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskFix",
    "SpeakerId": "Player",
    "Text": "Honestly, I was hoping you could fix my car, Buck.",
    "ResponseText": "",
    "Branches": "Buck_FixReply",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskRace",
    "SpeakerId": "Player",
    "Text": "That poster got me wondering about the race.",
    "ResponseText": "",
    "Branches": "Buck_ExplainRace",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskWork",
    "SpeakerId": "Player",
    "Text": "I'm looking for work, got anything for me?",
    "ResponseText": "",
    "Branches": "Buck_OfferWork",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_FixReply",
    "SpeakerId": "Buck",
    "Text": "Wish I had better news, partner. That old ride of yours is a stubborn mule, and parts for her are rarer than rain in July. Most folks would send her straight to the scrapyard, but I think you deserve a better shot. Tell you what, if you race for me out in the Maze, I'll buy your old heap fair and square. Put that money toward something a bit newer. Might not be shiny, but it'll get you where you're goin'. It ain't a free ride, but it's the best offer you'll find in these parts. What do you say? Ready for a little adventure?",
    "ResponseText": "",
    "Branches": "Player_RaceDeal;Player_DeclineLoop;Player_AskMazeRace",
    "Traits": "Hub",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_RaceDeal",
    "SpeakerId": "Player",
    "Text": "Alright, I'll race for you.",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_DeclineLoop",
    "SpeakerId": "Player",
    "Text": "Is there really no other way, Buck?",
    "ResponseText": "",
    "Branches": "Buck_DeclineLoop",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Player_AskMazeRace",
    "SpeakerId": "Player",
    "Text": "What's the Maze Race, Buck?",
    "ResponseText": "",
    "Branches": "Buck_ExplainRace",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_DeclineLoop",
    "SpeakerId": "Buck",
    "Text": "If there was, I'd tell you, honest. But this is your one good shot, sugar. No other shop in town will touch a car like that. The Maze is tough, but fair, and it's your best chance to trade up. Come on now, let's get you set up for a bit of fun out in the test area. You just might surprise yourself.",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_ExplainRace",
    "SpeakerId": "Buck",
    "Text": "The Maze Race? Now that's somethin' worth seein'. Folks from all over show up hopin' for a shot at glory. The Maze ain't just a bunch of dirt and turns—it's got more twists than a snake in a sack. If you got the grit, you might just win big. But first, you need a set of wheels. I've got three cars out back and a test area where you can get the feel for each one. Ready to see what you're made of?",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_OfferWork",
    "SpeakerId": "Buck",
    "Text": "Work, huh? Well, I always need a hand, especially someone with a little fire left in 'em. How about you help me out by racin' in the Maze? Winner gets a tidy sum, and you'll earn your keep the honest way. I've got a few cars out back, and a test area where you can shake 'em down before you decide. What do you think?",
    "ResponseText": "",
    "Branches": "Buck_GoToTestArea",
    "Traits": "",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  },
  {
    "Name": "Buck_GoToTestArea",
    "SpeakerId": "Buck",
    "Text": "Alright now, let's get you movin'. Out behind this garage, I've got a little test area—nothin' fancy, but it's good enough to stretch your legs. There's three cars out there: one's built for speed, one's quick off the line, and the last one hugs the corners like a possum on a persimmon. Try each one as much as you please. When you've made up your mind, drive the one you want back here into the garage and I'll fix you up proper. Take your time—ain't no rush at all. I'll be right here if you need me. Just holler if you get stuck, alright?",
    "ResponseText": "",
    "Branches": "",
    "Traits": "End",
    "Conditions": "",
    "PreAction": "",
    "PostAction": "",
    "AudioClip": ""
  }
]